<?php defined('LSKY') or die('Illegal access!');

/**
 * 数据库配置
 * User: WispX
 * Date: 2017/10/26
 * Time: 21:31
 * Link: http://gitee.com/wispx
 */

define('DB_HOST', 'localhost');
define('DB_USER', 'root');
define('DB_PASS', 'root');
define('DB_NAME', 'test');
define('DB_PORT', '3306');
define('DB_CHARSET', 'utf8');

return [
    // 非法关键字
    'blacklist' => [
        '死', '滚', 'http:', 'https:', 'av', '奶子', '操', '垃圾', '杀', 'www.', '根治', '阴茎', '子宫', '阴道', '淫荡', '轮奸',
        '销售发票', '买卖发票', '代售发票', '代为发票', '代购发票', '求购发票', '毒', '赌', '博彩', 'XXX', '盘口', '下注', '足彩',
        '偏方', '秘方', '根治', '根除', '治愈', '走私', '水货', '盗版', '口岸价', '港行', '外挂', 'QQ尾巴', '木马病毒', '枪', '武器',
        '管制刀具', '电鱼机', '网络钓鱼', '翻转车牌', '车牌隐形', '车牌隐型',
    ],
    // 表情
    'face'      => [
        '二哈', '柴犬', '柴犬不高兴', '柴犬再见', '柴犬哭', '柴犬舔舌头', '柴犬耍帅', '柴犬大嘴', '呵呵', '哈哈', '吐舌', '太开心',
        '笑眼', '花心', '小乖', '乖', '捂嘴笑', '滑稽', '你懂的', '不高兴', '怒', '汗', '黑线', '泪', '真棒', '喷', '惊哭', '阴险',
        '鄙视', '酷', '啊', '狂汗', 'what', '疑问', '酸爽', '呀咩爹', '委屈', '惊讶', '睡觉', '笑尿', '挖鼻', '吐', '犀利', '小红脸',
        '懒的理', '勉强', '爱心', '心碎', '玫瑰', '礼物', '彩虹', '太阳', '星星月亮', '钱币', '茶杯', '蛋糕', '大拇指', '胜利', 'haha',
        'OK', '沙发', '手指', '香蕉', '便便', '药丸', '红领巾', '蜡烛', '音乐', '灯泡',
    ],
];